README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org399672d)
2.  [Resumo e/ou informação extra:](#org5af8e0e)
3.  [Versão:](#orga84c060)
4.  [Data:](#orgcbdd1a7)
5.  [Autor de Contato:](#orgdb1ce08)
6.  [Lista dos Autores:](#org8edbfdd)
7.  [Áreas de pesquisa vinculadas:](#org52d173c)
8.  [Vinculo com:](#org05a300b)
9.  [Paradigmas:](#orge884440)
10. [Tipo de Interface:](#orgc0dccf8)
11. [Plataformas Suportadas:](#org1703f88)
12. [Linguagens Utilizadas:](#orgb47bda3)
13. [Bibliotecas Utilizadas (dependências):](#org6d46491)
14. [Softwares utilizados (dependências)](#org76c37c7)
15. [Tipo de Licença:](#org38b5275)
16. [Links:](#org8cd7d6e)


<a id="org399672d"></a>

# Nome do Software (ou Biblioteca):

-   ANÁLISE DA QUEDA DE PRESSÃO DEVIDO A MIGRAÇÃO DE FINOS OCASIONADA PELA INJEÇÃO DE ÁGUA DE BAIXA SALINIDADE


<a id="org5af8e0e"></a>

# Resumo e/ou informação extra:

-   Desenvolver um projeto de Engenharia de Software que calcule a quantidade

de partículas depositadas no meio poroso devido a migração de finos, utili-
zando como dados/informações de referência os valores da literatura ou de
experimentos laboratoriais, os quais serão inseridos pelo usuário por meio de
arquivos .txt. Por meio do software será possível analisar o declínio de perme-
abilidade, ou seja o dano à formação, devido a quantidade de partículas retidas
no meio poroso e assim evitar prejuízos ecônomicos as indústrias petróliferas,
pois será possível realizar uma análise e um estudo prévio do caso.


<a id="orga84c060"></a>

# Versão:

-   1.0.


<a id="orgcbdd1a7"></a>

# Data:

-   2021/2 - segundo semestre.


<a id="orgdb1ce08"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org8edbfdd"></a>

# Lista dos Autores:

-   Sayori Uto Borges
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org52d173c"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Reservatório
-   Dano a formação


<a id="org05a300b"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orge884440"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgc0dccf8"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org1703f88"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orgb47bda3"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org6d46491"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org76c37c7"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org38b5275"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org8cd7d6e"></a>

# Links:

